Revit 2027 API
ImageExportOptions.IsValidFileName Method
 Verify if File name is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFileName(
	string filePath
)
Public Shared Function IsValidFileName (
	filePath As String
) As Boolean
public:
static bool IsValidFileName(
	String^ filePath
)
static member IsValidFileName :
        filePath : string -> bool
Parameters
filePath String
 File path to be tested for valid file name
Return Value
Boolean
 True if File name is valid; false otherwise
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace